## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.tls will be created
+   resource "kubernetes_secret" "tls" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-com-cinema-tls"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # tls_locally_signed_cert.cert will be created
+   resource "tls_locally_signed_cert" "cert" {
+       allowed_uses          = [
+           "cert_signing",
+           "client_auth",
+           "digital_signature",
+           "key_encipherment",
+           "server_auth",
        ]
+       ca_cert_pem           = (known after apply)
+       ca_key_algorithm      = (known after apply)
+       ca_private_key_pem    = (sensitive value)
+       cert_pem              = (known after apply)
+       cert_request_pem      = <<-EOT
-            ----BEGIN CERTIFICATE REQUEST-----
            MIICdTCCAV0CAQAwMDEUMBIGA1UEChMLV2F5T2ZUaGVTeXMxGDAWBgNVBAMTD3dh
            eW9mdGhlc3lzLmNvbTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAPK0
            5Hf14q0GBeADRmgDLU88q21p/iWiu7QfwFh0zzJRLpAF86sukCCGUCbSGNRiZYfe
            dcTF0IxhGOIydSQD4j6ffjM+7a/AT0c9GN9DaJzVnw4ytHFhW24UI7q/5l6IpdHG
            EwlLzvE5vtionH+x9mhTPXT949rMeL1s3gyfcSALdp6uCX/+/VNxbb79kU2qqXjx
            LM/j7HG9gtuDPTTDZbyW5X9EMubymMRRQXQYbKwi41ywrFBq/PrDdi/caxi/CkuI
            8afSUffCBbPfDT1cG2Z5aEEo3ul4iioV4adejPhm0hENBRKDncL2omoA//u8j2km
            zCbMGOzWNpvTlb2imBkCAwEAAaAAMA0GCSqGSIb3DQEBCwUAA4IBAQAPuoAqB0PM
            8xM/4teLwMWOIjkbES3SY7EtkGJ5vkMGuOy/GHH8n42jCozQ0Obau+9EyZOh9PLo
            ZO2+7ZUIhdPcdHsxMrcQqZhUwiRO3JSnCnZwZqjdDdYDTvemmzkcd30x0mYDw2XV
            2YPPmrDrzMgwl3EVVT4d6hhL/yHSNyrE5XmHeE+LEccD3/gljAXKYHOOUedfqYik
            4Sk1MisFLglKoaG7gEEuA9CaTpeqrK8V9+qATf+LaVEIF9bxG7PFoeFLePWS8mk7
            30jCouuR+74zgV1lI/hR3xGHMFokkDg+GWtk4Jn6neiSH1W6IbeqNwq5q6v3ucIc
            iW2IeY+Go9Cj
-            ----END CERTIFICATE REQUEST-----
        EOT
+       early_renewal_hours   = 0
+       id                    = (known after apply)
+       is_ca_certificate     = false
+       ready_for_renewal     = false
+       set_subject_key_id    = false
+       validity_end_time     = (known after apply)
+       validity_period_hours = 8760
+       validity_start_time   = (known after apply)
    }

  # tls_self_signed_cert.ca is tainted, so must be replaced
-/+ resource "tls_self_signed_cert" "ca" {
!       cert_pem              = <<-EOT
-            ----BEGIN CERTIFICATE-----
            MIIDHzCCAgegAwIBAgIRALNhlV9pGD6/L4sZNDWEoRAwDQYJKoZIhvcNAQELBQAw
            KTEUMBIGA1UEChMLV2F5T2ZUaGVTeXMxETAPBgNVBAMTCGNhLmxvY2FsMB4XDTIy
            MDkxNzIyNTc0M1oXDTIzMDkxNzIyNTc0M1owKTEUMBIGA1UEChMLV2F5T2ZUaGVT
            eXMxETAPBgNVBAMTCGNhLmxvY2FsMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
            CgKCAQEAuO4KHZJWW7eZXmwHbrSsh1UDAAmdvq6O8nIxzQia8Baf43Ae4fD2jp3z
            BRpuLyaxw/rY/3t9y2l3X9w+N64yvfzNI2ACH3yKBNxDJKaRui3Iu4DJx5aAGY2f
            RNgye92iDiTMo8GMDgFxoXBfxPu34zgZ5S2fDUjvSqV0WHMvnFjeyjn18z2JPMcm
            tqB6+dzJ224nM9D7gK4VXmx4F3KfnLrWKPZd5Jzc9TL6oJo+feA2hLZWPMVdlfTM
            hbsf8rqB/c4rcw6BBXdQnrg6V+3UEDhIFYmgD3o7EFv9OCm0Sr/1JYMkGD/R17PD
            4C5npfsrOjrT2q0Fd1K0bpf5VjG9XwIDAQABo0IwQDAOBgNVHQ8BAf8EBAMCAqQw
            DwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUl+XPPGrFk+tL+W/hB8qwcaBUinow
            DQYJKoZIhvcNAQELBQADggEBAChEyBLd/umZRUeppSMoJLd3TYgx/miHlWhvmoZ+
            CFVTlqWc4yrqrPNCaXXqPK5nRiz4kVhdYYrX0qI+HVzScfNjxgyDNxjU0WTBHSeV
            LhHB8HK6LY/jhyCLVVH2OSU+FAYxtlTZ/b51JVI7xo9D+sLSU00YgalrAQoqb/N7
            t4jKhn5p21XreLPnPDiinbqHqLXqwSuFyt7LH3/q4R2RehuCrskPw8g2K3H74lH+
            8qZgOYL7m+VoeIxO4ZGtBE5cNdZqVlJTZtv8jxs3hUwTunxasINBwUZCiHdfs+Kd
            JzXZM8bHgpHwwBiUTE13PoPa9l57PECuysV8AcDPnw+oX3g=
-            ----END CERTIFICATE-----
        EOT -> (known after apply)
!       id                    = "238438493679009439048142060427627766032" -> (known after apply)
!       key_algorithm         = "RSA" -> (known after apply)
!       validity_end_time     = "2023-09-17T22:57:43.645328816Z" -> (known after apply)
!       validity_start_time   = "2022-09-17T22:57:43.645328816Z" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
